<!-- add-pr-comment:add-pr-comment -->

## Terraform CloudWatch Alarms plan
```
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarms[0].data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsModPlatform]
module.modernisation_platform_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts]
module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm]
module.operations_engineering_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts]
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarms[0].data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEvents]
data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=Levgorbunov1CancelWorkflowEvents]
module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["kudzai.mtoko@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts:8081d210-5220-4ade-a569-7987f14797ef]
module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["modernisation-platform@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts:71e5486e-76ed-4087-956f-aa5a8a1ad47f]
module.operations_engineering_topic.aws_sns_topic_subscription.email_subscription["lev.gorbunov@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:27741290-2203-45ed-8cd0-9982d078f215]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsAlarm]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=Levgorbunov1CancelWorkflowEventsAlarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.unauthorised_users_modify_repository_settings[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "unauthorised_users_modify_repository_settings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for unauthorised repository settings modification - Group 1"
      + alarm_name                            = "UnauthorisedRepoSettingsGroup1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnauthorisedRepoSettingsGroup1"
      + namespace                             = "CustomMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.unauthorised_users_modify_repository_settings_alarms[0].aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "UnauthorisedRepoSettingsGroup1"
      + pattern        = "{ ($.eventName = \"repo.access\" || $.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\" || $.eventName = \"repo.actions_enabled\" || $.eventName = \"repo.advanced_security_disabled\" || $.eventName = \"repo.advanced_security_enabled\" || $.eventName = \"repo.archived\" || $.eventName = \"repo.code_scanning_analysis_deleted\" || $.eventName = \"repo.code_scanning_autofix_disabled\" || $.eventName = \"repo.update_actions_settings\" || $.eventName = \"repo.update_default_branch\" || $.eventName = \"repo.rename\" || $.eventName = \"repository_branch_protection_evaluation.disable\" || $.eventName = \"repository_ruleset.create\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-github-oidc-provider\") }"

      + metric_transformation {
          + name      = "UnauthorisedRepoSettingsGroup1"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorised_users_modify_repository_settings_alarms[0].aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for unauthorised repository settings modification - Group 1"
      + alarm_name                            = "UnauthorisedRepoSettingsGroup1Alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnauthorisedRepoSettingsGroup1"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be destroyed
  # (because aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      - id             = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - log_group_name = "/aws/lambda/GitHubIngestFunction" -> null
      - name           = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - pattern        = "{ ($.eventName = \"repo.access\" || $.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform\" || $.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
          - namespace  = "GitHubMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ] -> null
      - alarm_description         = "Alarm for when any user modifies the settings of ministryofjustice/modernisation-platform repository" -> null
      - alarm_name                = "UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:880656497252:alarm:UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - namespace                 = "GitHubMetrics" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "missing" -> null
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```